# Функції та видність змінних
x = 10  # глобальна змінна

def get_x() :  # casing: snake_case
    return x   # звернення до глобальної змінної


def main() :
    print( "x = ", get_x() )


if __name__ == "__main__" : main()

'''
Реалізувати програму для введення двох різних позитивних
чисел та розрахунок їх суми. Якщо числа негативні або однакові
пропонується повторне введення
> Введіть х = -1
Число має бути додатнім
> Введіть х = 1
> Введіть y = -1
Число має бути додатнім
> Введіть y = 1
Числа мають відрізнятись
> Введіть y = 2
1 + 2 = 3
'''